{
    "title": "DeePSD: Automatic Deep Skinning And Pose Space Deformation For 3D Garment Animation",
    "conference": "ICCV 2021",
    "authors": [
        {
            "name": "Hugo Bertiche",
            "email": "mailto:hugo_bertiche@hotmail.com",
            "affiliations": [1, 2]
        },
        {
            "name": "Meysam Madadi",
            "email": "mailto:mmadadi@cvc.uab.cat",
            "affiliations": [1, 2]
        },
        {
            "name": "Emilio Tylson",
            "email": "mailto:emilio.tyl@gmail.com",
            "affiliations": [1]
        },
        {
            "name": "Sergio Escalera",
            "email": "https://sergioescalera.com/",
            "affiliations": [1, 2]
        }
    ],
    "affiliations": ["Universitat de Barcelona", "Computer Vision Center"],
    "URLs": {
        "paper": "https://openaccess.thecvf.com/content/ICCV2021/html/Bertiche_DeePSD_Automatic_Deep_Skinning_and_Pose_Space_Deformation_for_3D_ICCV_2021_paper.html",
        "arxiv": "https://arxiv.org/abs/2009.02715",
        "youtube": "https://youtu.be/1Ix9nqQ-cW8",
        "github": "https://github.com/hbertiche/DeePSD",
        "data": null
    },
    "abstract": "We present a novel solution to the garment animation problem through deep learning. Our contribution allows animating any template outfit with arbitrary topology and geometric complexity. Recent works develop models for garment edition, resizing and animation at the same time by leveraging the support body model (encoding garments as body homotopies). This leads to complex engineering solutions that suffer from scalability, applicability and compatibility. By limiting our scope to garment animation only, we are able to propose a simple model that can animate any outfit, independently of its topology, vertex order or connectivity. Our proposed architecture maps outfits to animated 3D models into the standard format for 3D animation (blend weights and blend shapes matrices), automatically providing of compatibility with any graphics engine. We also propose a methodology to complement supervised learning with an unsupervised physically based learning that implicitly solves collisions and enhances cloth quality."
}